# Brewfile - Declarative Homebrew dependencies
# Install with: brew bundle install

# Taps
tap "steveyegge/beads"

# CLI Tools
brew "bd"
brew "bat"
brew "delta"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "go"
brew "jq"
brew "ripgrep"
brew "sd"
brew "starship"
brew "terminal-notifier"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
