# Brewfile - Declarative Homebrew dependencies
# Install with: brew bundle install

# CLI Tools
brew "bat"
brew "coreutils"
brew "delta"
brew "eza"
brew "fd"
brew "mise"
brew "fzf"
brew "gh"
brew "go"
brew "jq"
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "starship"
brew "terminal-notifier"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
